{
  "narrative": [
    "The coffee had gone cold hours ago, but she kept the mug close anyway. It was a comfort thing, like the worn sweater she refused to throw out. The rain tapped against the window in an uneven rhythm. She thought about calling him, then thought better of it. Some conversations were better left for daylight. The cursor blinked on her screen, patient and undemanding. Tomorrow would be different, she told herself. Tomorrow always was.",
    "He found the letter tucked inside a book he hadn't opened in years. The paper had yellowed at the edges, and the handwriting was unmistakably his mother's. He sat down slowly, not trusting his legs. The words blurred as he read them, then sharpened into focus. She had known all along. She had forgiven him before he even asked. The book fell closed in his lap, and he sat there until the light changed.",
    "The train pulled away from the platform just as she reached it. For a moment she stood there, breathless and frustrated. Then something shifted. The next train would come in twenty minutes. Twenty minutes she hadn't expected to have. She bought a coffee, sat on a bench, and watched strangers hurry past. A child waved at her from a stroller. She waved back. Sometimes missing what you wanted led to something you needed.",
    "They had been walking for three hours when the trail markers disappeared. The map showed a fork that didn't exist in reality. He wanted to turn back. She wanted to push forward. They argued briefly, then fell into silence. The forest didn't care about their disagreement. Eventually they picked a direction and kept moving. That was the thing about being lost. You had to keep moving anyway.",
    "The restaurant was empty except for an old man in the corner booth. He ordered the same thing every Tuesday, the waitress said. Meatloaf, mashed potatoes, black coffee. He always left a twenty dollar tip and never said more than thank you. She wondered what his story was. Everyone had one. The kitchen bell rang, and she went back to work, carrying other people's meals to other people's tables.",
    "Maya unlocked the door to find the apartment exactly as she'd left it. The plants were dead, of course. Three months was too long. She dropped her suitcase by the door and walked to the window. The city looked different from up here, smaller somehow. Her phone buzzed with messages she wasn't ready to answer. First, she needed to remember how to be home. That would take longer than unpacking.",
    "The interview lasted forty-five minutes, but James only remembered fragments. A question about leadership. Something about his biggest weakness. The interviewer's pen tapping against the table. He'd prepared for weeks, rehearsed answers until they felt natural. None of it had gone according to plan. Walking out, he couldn't tell if that was good or bad. Sometimes the best conversations were the unexpected ones.",
    "Clara watched her daughter take her first steps across the kitchen floor. Three wobbly steps, then a tumble. Then up again, determined. It reminded her of something her own mother used to say: falling is just practicing for standing. She reached out her hands, ready to catch her if needed. But the girl didn't need catching. She was already walking toward the door, ready to explore what came next.",
    "The old photograph showed a family he barely recognized. His grandparents, young and smiling, standing in front of a house that no longer existed. Three children clustered around their legs. One of them was his father, maybe five years old. The others he couldn't name. So much history, compressed into a single faded image. He wondered what they'd been thinking in that moment. What they'd hoped for.",
    "Sarah found the notebook in the back of her closet, buried under college textbooks she'd never sold. The handwriting was hers, but younger. Dreams and plans she'd forgotten she'd had. Some of them had come true. Most hadn't. She wasn't sure if that was sad or simply realistic. People change. Goals change. The person who wrote these words was someone she used to be, not someone she'd failed to become."
  ],
  "technical": [
    "The function was supposed to return a sorted array, but edge cases kept breaking it. Null inputs, empty arrays, arrays with one element. Each fix introduced a new bug somewhere else. He stepped away from the keyboard and stared at the whiteboard. Sometimes the solution came when you stopped looking for it. He drew the problem from scratch, tracing the data flow with a dry erase marker. There it was. The off-by-one error hiding in plain sight.",
    "Database migrations are deceptively simple until they aren't. You write the schema change, test it locally, push it to staging. Everything works. Then production reveals the million rows you forgot about. The migration times out. Connections pile up. Users start complaining. Rollback isn't clean because some data already changed. Next time, you tell yourself, you'll batch the updates. Next time you'll test with production-scale data. Next time.",
    "The API returned a 200 status code, but the response body was empty. He checked the logs. Nothing unusual. He checked the network tab. Request looked fine. He added console logs everywhere, rebuilt the project, cleared the cache. Still empty. Two hours later he found it. A middleware was swallowing the response before it reached the client. Six lines of code written eight months ago by someone who no longer worked there.",
    "Version control saved him again. The feature branch had diverged so far from main that merging seemed impossible. Conflicts in every file. Logic that contradicted itself. He considered starting over, but the commit history told a story. Small, atomic commits with clear messages. He cherry-picked the ones that mattered, tested each change, rebuilt the feature piece by piece. It took a full day, but the code was cleaner than before.",
    "Memory leaks are patient killers. The application runs fine for hours, days even. Then performance degrades. Response times creep up. Eventually the server crashes and everyone panics. Finding the leak is detective work. Heap snapshots, allocation timelines, reference chains. Usually it's something small. An event listener never removed. A cache that grows forever. A closure holding onto objects it no longer needs.",
    "The deploy failed at 3 AM, which was exactly when nobody was watching. By morning, the error logs had grown to 50 gigabytes. Customers had been seeing blank pages for six hours. The fix took twelve minutes. A missing environment variable, set in development but never copied to production. They added it to the checklist. Checklists only work if you use them. Next time, they promised. Next time they'd use the checklist.",
    "Code review caught the bug before it shipped. A simple typo, really. Someone had written 'lenght' instead of 'length' and the linter didn't catch it because the variable was dynamically named. The reviewer almost missed it too. But something looked wrong. She stared at the line for thirty seconds before it clicked. That's why fresh eyes matter. The person who wrote the code couldn't see what was right in front of them.",
    "Testing in production sounds reckless until you realize everyone does it. The question is whether you do it intentionally. Feature flags, canary deployments, gradual rollouts. These are just fancy names for testing in production, but safely. You watch the metrics. You set up alerts. You build in ways to roll back quickly. The system is never really finished. It's just in a state of controlled experimentation.",
    "Documentation is a love letter to your future self. You write it when you understand the code, so that later, when you've forgotten everything, you have something to reference. Good documentation explains why, not just what. The code shows what. Comments and docs should explain the reasoning. Why this approach and not another? What constraints existed? What tradeoffs were made? Without that context, code becomes archaeology.",
    "The refactor started small, as they always do. Just cleaning up one function. But that function called another, which depended on a third. Three days later, she had touched every file in the repository. The tests all passed. The behavior was identical. But the code was finally readable. Sometimes you have to make a mess to clean a mess. The key is knowing when to stop."
  ],
  "reflective": [
    "Most of what we worry about never happens. We spend hours rehearsing conversations that go differently than we imagined. We prepare for disasters that never arrive. The real challenges come sideways, from directions we never thought to watch. Maybe that's the point. We can't prepare for everything, so we prepare for something. It gives us the illusion of control. Sometimes the illusion is enough to get us through.",
    "Habits form slowly, then all at once. For weeks you force yourself to do the thing. It feels unnatural, effortful, wrong. Then one morning you do it without thinking. The resistance is gone. The path is worn smooth. This works in both directions, of course. Good habits and bad ones follow the same rules. The only difference is which ones you choose to reinforce. Every day is a vote for the person you're becoming.",
    "Time moves strangely when you're paying attention to it. Minutes stretch and hours compress. A conversation can feel like a lifetime. A year can vanish in a blink. The trick, maybe, is to stop measuring. To let moments be whatever size they want to be. But we're not built for that. We count and compare and calculate. We turn experience into numbers because numbers feel real. Even when they lie.",
    "Asking for help is harder than it should be. We tell ourselves we don't want to be a burden. We tell ourselves we should be able to figure it out alone. Pride disguises itself as self-reliance. But everyone needs help sometimes. Everyone has carried weight they couldn't lift alone. The people who seem most capable usually got that way because someone helped them first. Strength isn't doing everything yourself. It's knowing when to reach out.",
    "Perfectionism is procrastination wearing a fancy coat. We tell ourselves we're waiting until we can do it right. We're not waiting. We're hiding. The messy first draft is always better than the pristine nothing. Ships that stay in harbor are safe, but that's not what ships are for. Launch the thing. Fix it in public. Learn from the embarrassment. The people who seem fearless are just better at acting before the fear takes hold.",
    "Comparison is the thief of joy, but we do it anyway. We scroll through curated highlights of other people's lives and wonder why ours feels so ordinary. But nobody posts their failures. Nobody shares the mundane Tuesday afternoons or the moments of quiet doubt. What we're comparing ourselves to doesn't exist. It's a fiction, a highlight reel mistaken for reality. The only fair comparison is to who we were yesterday.",
    "Rest is not a reward for productivity. It's a requirement for it. We've been taught that busy is better, that doing more means achieving more. But the research says otherwise. The brain needs downtime to consolidate learning. Creativity requires idle moments. The best ideas often come when we're not looking for them. Rest isn't something we earn. It's something we need. Treating it otherwise leads to burnout.",
    "Failure is data, not destiny. Every mistake contains information about what doesn't work. The question is whether we're paying attention. Some people fail and quit. Others fail and adjust. The difference isn't talent or luck. It's mindset. Do you see setbacks as evidence of your limitations, or as steps on the path to competence? The interpretation shapes everything that follows.",
    "Simplicity is the ultimate sophistication, as someone once said. But achieving simplicity is hard. It requires understanding something so deeply that you can strip away everything unnecessary. Beginners make things complicated because they don't know what matters. Experts make things simple because they've figured out what doesn't. The journey from complexity to simplicity is the journey from novice to master.",
    "Consistency beats intensity over time. The person who shows up every day, even when they don't feel like it, will outperform the one who works in bursts of enthusiasm followed by long breaks. This isn't about grinding yourself down. It's about sustainable effort. Small actions, repeated regularly, compound into significant change. The trick is making the action small enough that you can do it even on bad days."
  ],
  "descriptive": [
    "The market opened at dawn, before the heat made standing unbearable. Vendors arranged their stalls with practiced efficiency. Pyramids of oranges, bundles of herbs, fish laid out on ice that wouldn't last until noon. The smell was overwhelming at first, then faded into background noise. Customers haggled in three languages. Children ran between the stalls, chased by mothers and shopkeepers. By ten o'clock the crowds would thin. By noon the market would be a memory until tomorrow.",
    "The library occupied the entire third floor of a building that used to be a factory. Tall windows let in light that fell across reading tables in long rectangles. The shelves were mismatched, donated over decades from estates and closings. Nothing was organized by any system an outsider could understand. The librarian knew where everything was. She had been there forty years and remembered every book that came and went. People whispered without being told to.",
    "Snow changed everything about the neighborhood. Cars became white lumps. Fences disappeared. The usual landmarks lost their meaning. Children appeared from nowhere, dragging sleds and building forts. Sound traveled differently, muffled and close. The city felt smaller, more manageable. For a few hours, nobody went anywhere. Everyone was stuck together, watching the same storm, waiting for the same plows. Then the roads cleared and the world sped up again.",
    "The workshop smelled like sawdust and machine oil. Tools hung on pegboard walls, each outlined in marker so you knew where it belonged. The workbench was scarred with decades of projects. Cuts and burns and stains that told stories. He had learned everything here, watching his grandfather's hands shape wood into furniture. Now the hands were his own, older than he remembered, doing the same work. The radio played songs from before he was born.",
    "The beach at low tide revealed a different world. Tide pools held galaxies of small life. Crabs sidled under rocks. Anemones closed when touched. The wet sand held footprints for seconds before erasing them. She walked the waterline, looking for sea glass worn smooth by years of tumbling. Each piece had been trash once. A bottle thrown overboard, a broken window, someone's discarded thing. Now they were treasures, transformed by time and patience.",
    "The subway car was packed, bodies pressed together in reluctant intimacy. A woman read a paperback, somehow finding room to turn pages. A teenager's headphones leaked bass rhythms. An old man clutched a grocery bag like it contained something precious. Nobody made eye contact. This was the unwritten rule. But everyone was listening, sensing, aware of each other in ways they'd never admit. The doors opened and the crowd reshuffled. Different people, same dance.",
    "Autumn had come early this year. The leaves turned brilliant shades of orange and red, carpeting the sidewalks in color. Morning light slanted through branches, casting patterns on the ground. There was a crispness to the air that made every breath feel intentional. People walked faster, pulled jackets tighter. Summer's laziness had faded. Now everyone was preparing, in their own ways, for what came next.",
    "The kitchen at seven in the morning was a study in chaos. Pans sizzled. Timers beeped. Servers shouted orders and cooks shouted back. Steam rose from every surface. It looked like madness, but there was order beneath the noise. Everyone knew their station. Every movement had a purpose. By eight, the breakfast rush would end and the chaos would become calm. Until lunch, when it started again.",
    "The concert hall hummed with anticipation. Two thousand people in velvet seats, programs in laps, phones silenced. The lights dimmed slowly, deliberately. A hush spread through the room. Then the conductor walked on stage, and applause erupted. She bowed once, turned to the orchestra, raised her baton. The silence that followed was different. It was expectant, charged. And then the music began.",
    "Rain fell on the old city in sheets, turning cobblestone streets into mirrors. Umbrellas bloomed like flowers in a time-lapse. Cafes filled with people waiting out the storm, steam rising from coffee cups. Conversations grew louder to compete with the downpour. Lightning flashed, illuminating centuries-old buildings in momentary white. Then darkness again, and the steady percussion of rain on stone."
  ],
  "instructional": [
    "Start with the smallest possible version that could work. Don't plan for scale you don't have. Don't solve problems you don't have yet. Build the thing, put it in front of users, and watch what happens. They will surprise you. They will use it wrong. They will ask for features you never imagined. That's the information you need. You can't think your way to product market fit. You have to build your way there, one embarrassing version at a time.",
    "Writing clearly is thinking clearly. If you can't explain something simply, you don't understand it well enough. Start by writing badly. Get the ideas out of your head and onto the page. Don't edit while you write. That's two different jobs using two different parts of your brain. Finish the draft, then go back. Cut everything that doesn't need to be there. Read it out loud. If you stumble, rewrite. Repeat until the words disappear and only the meaning remains.",
    "Debugging is a skill that improves with practice. Start by reproducing the bug consistently. If you can't make it happen on demand, you're not ready to fix it. Form a hypothesis about the cause. Design an experiment to test it. Change one thing at a time and observe the result. Keep notes. The bug you're chasing today will have a cousin next month. When you finally find it, ask why it was possible in the first place. Fix the system, not just the symptom.",
    "Giving feedback is an act of respect. It means you believe someone can improve. Start with what's working. Be specific. Then address what could be better, also specifically. Vague criticism helps no one. Own your perspective. Say I think or I noticed rather than presenting opinions as facts. Ask questions instead of making accusations. Remember that the goal is growth, not punishment. The best feedback leaves someone energized to try again.",
    "Learning a new skill follows a predictable pattern. First, unconscious incompetence. You don't know what you don't know. Then conscious incompetence. You see the gap between where you are and where you want to be. This stage is uncomfortable. Push through it. Next comes conscious competence. You can do the thing, but it requires focus. Finally, unconscious competence. The skill becomes automatic. Most people quit in stage two. Don't be most people.",
    "Reading faster starts with reading more. Your brain recognizes patterns, and the more you read, the more patterns you build. Don't subvocalize every word. Let your eyes scan phrases, not individual letters. Use a pointer if it helps. Practice with material slightly above your comfort level. Speed comes with comprehension, not at its expense. The goal isn't to rush through words. It's to process them more efficiently.",
    "Making decisions gets easier when you separate reversible from irreversible ones. For reversible decisions, move quickly. You can always change course. For irreversible ones, slow down. Gather information. Consult others. But don't confuse importance with reversibility. Many important decisions are reversible. Many trivial ones aren't. The framework helps you allocate your mental energy where it actually matters.",
    "Negotiation isn't about winning. It's about finding agreements that work for everyone. Start by understanding what the other side actually wants. Often it's not what they're asking for. Look for creative solutions that expand the pie. Trade things you value less for things you value more. Be willing to walk away, but only if you mean it. The best deals leave both parties feeling like they got something worthwhile.",
    "Building a habit requires three things: a cue, a routine, and a reward. The cue triggers the behavior. The routine is the behavior itself. The reward is why you keep doing it. To build a new habit, attach it to an existing cue. After I pour my morning coffee, I'll write for ten minutes. Make the routine small enough that resistance is low. And make sure the reward is immediate, not distant. Your brain doesn't work on long timelines.",
    "Public speaking gets better with practice, but only if you practice correctly. Record yourself. Watch the recording, painful as it is. Notice what works and what doesn't. Don't try to fix everything at once. Pick one thing to improve and focus on that. Get feedback from others, but filter it through your own judgment. Not all advice applies to your style. The goal isn't to become someone else. It's to become a better version of yourself."
  ],
  "dialogue": [
    "\"I don't understand why you're upset,\" he said, setting down his coffee. She laughed, but there was no humor in it. \"That's exactly the problem.\" The silence stretched between them. Outside, a car alarm started and stopped. \"Can we try this again?\" he asked. \"Can we start over?\" She looked at him for a long moment. \"We can try,\" she said finally. \"But trying isn't the same as succeeding.\"",
    "\"What do you want to be when you grow up?\" The question caught her off guard. She was forty-three years old. \"I'm still figuring that out,\" she admitted. Her daughter nodded seriously. \"That's okay, Mom. I change my mind every week.\" There was wisdom in that, she realized. The idea that you had to decide once and forever was a lie adults told themselves. Growth didn't stop at a particular age.",
    "\"Tell me the truth,\" she demanded. \"Even if I don't want to hear it.\" He hesitated. The truth was complicated. The truth might hurt. But she deserved honesty. \"I think you're making a mistake,\" he said slowly. \"But I also think it's yours to make.\" She considered this. \"That's not really an answer.\" \"No,\" he agreed. \"But it's the best one I have.\"",
    "\"Do you remember the first time we met?\" she asked. He smiled. \"You spilled coffee on my laptop.\" \"I did not spill it. It was already falling when I walked by.\" \"You definitely spilled it.\" \"Fine. But you're the one who asked for my number.\" \"Only because I needed your insurance information.\" They both laughed. Twenty years, and the story still made them laugh.",
    "\"Why did you become a teacher?\" the student asked. Mr. Collins paused, chalk in hand. \"Because someone once told me I couldn't do it.\" \"That's it?\" \"That's not the whole story. But it's where the story starts.\" He turned back to the board. \"The best motivation is wanting to prove someone wrong. Just make sure you're proving them wrong for the right reasons.\""
  ],
  "numbers": [
    "The meeting was scheduled for 2:30 in the afternoon, but nobody showed up until 2:47. By 3:15, they had covered exactly one of the seven agenda items. At 4:00, someone suggested continuing tomorrow. The project that should have taken 6 weeks stretched into 14. This was the way of things. Estimates were guesses wearing suits.",
    "She checked the receipt twice. The total came to 147 dollars and 53 cents. For three items. The cashier shrugged apologetically. Prices had gone up 23 percent since last year, more in some categories. The eggs alone were 8 dollars. She remembered when they were 2. That wasn't so long ago. Maybe 5 years, maybe 7. Time and money both moved faster than expected.",
    "The apartment was 850 square feet on paper, but felt smaller. Rent was 2,400 a month, plus utilities. That worked out to about 28,800 a year, or roughly 35 percent of her income. The experts said housing should be 30 percent. The experts didn't live in this city.",
    "He ran the numbers again: 45 minutes to the airport, 2 hours early for international flights, a 12-hour journey with 1 layover, then 90 minutes through customs. Door to door, the trip took 18 hours. For a meeting that lasted 3. But some conversations couldn't happen over video. Some deals required being in the room.",
    "The recipe called for 3 cups of flour, 2 tablespoons of sugar, and 1 teaspoon of salt. She had been making this bread for 15 years and still measured everything exactly. Her grandmother had done it by feel, adding flour until it felt right. After hundreds of loaves, she still didn't trust her instincts. Numbers were a safety net."
  ],
  "questions": [
    "What makes a good life? The question had no simple answer. Some said happiness, but happiness was fleeting. Others said meaning, but meaning could be found in suffering. Maybe it was about connection? About leaving something behind? She turned the question over in her mind, examining it from different angles. Perhaps asking was the point. Perhaps the search itself was the answer.",
    "How do you know when you're ready? The honest answer: you don't. Readiness is a feeling that often arrives after the fact. You take the leap and discover, mid-air, that your wings work. Or they don't, and you learn to fall gracefully. Either way, waiting for certainty is waiting forever. At some point you have to choose uncertainty over paralysis.",
    "Why do we fear change when change is the only constant? Perhaps because constants are comforting. Perhaps because the known, even when painful, feels safer than the unknown. But change comes regardless of our feelings about it. The only choice is whether to resist or adapt. Resistance is exhausting. Adaptation is hard. Neither is optional.",
    "Where does creativity come from? Some say it's divine inspiration. Others call it the subconscious, working while we're not watching. Maybe it's just connections between ideas that weren't connected before. The brain finding patterns in chaos. Whatever it is, it can't be forced. You can only create the conditions for it to arrive. Then wait, and hope.",
    "When is the right time to speak up? When the stakes are high enough to matter, but not so high that you're paralyzed? When you have the words, but before you lose your nerve? There is no formula. Sometimes the right time was yesterday. Sometimes it's never. The only way to know is to try, and to forgive yourself when you get it wrong."
  ],
  "symbols": [
    "The file path was buried deep: C:\\Users\\Documents\\Projects\\2024\\archive. She navigated folder by folder; each click revealed another layer of forgotten work. 67 subfolders in total. Somewhere in there was the file she needed = the one with the client's original requirements. After 7 hours of searching, she found it in [backup] of all places.",
    "He typed the command carefully: `git checkout -b feature/login-fix` and waited. The terminal blinked; nothing happened. Error: branch 'feature/login-fix' already exists. Of course it did. He'd created it 6 days ago and forgotten. `git branch -D feature/login-fix` to delete, then try again. Version control had a longer memory than he did.",
    "The recipe read: 1/2 cup sugar; 3/4 cup flour; 6 eggs [room temperature]; 7 tablespoons butter. She double-checked each measurement = precision mattered in baking. The ratio of wet to dry ingredients had to be exact. One wrong substitution and the whole thing would collapse. Unlike cooking, baking didn't forgive improvisation.",
    "The equation seemed simple: x = 7y + 6. But nothing in calculus was ever simple. She worked through it step by step; derivative here, integral there. The answer kept coming out wrong. She checked her work against the solution manual [page 247] and found her error. A misplaced negative sign. One character; thirty minutes lost.",
    "Directory structure matters more than people think. /src for source code; /lib for libraries; /tests for test files. Keep config in the root = easier to find. Use [brackets] for optional parameters in documentation. Escape special characters with \\ when needed. These conventions exist for a reason; they make collaboration possible.",
    "The meeting invite said 6:30 PM / 7:00 PM depending on timezone. She was never sure which applied to her; the company had offices in 7 countries. She checked the calendar = it showed 6:30 local time. Or did it? The `[tentative]` tag made her nervous. Better to join early and wait than miss the first 15 minutes.",
    "His password requirements were absurd: 1 uppercase; 1 lowercase; 1 number [0-9]; 1 symbol from the set {!@#$%^&*}. Minimum length = 16 characters. No repeating patterns. Must include at least 6 unique characters. He ended up with something like `Tr0ub4dor&7/Horse` and promptly forgot it. The \\reset link became his most visited page.",
    "The regex pattern looked like nonsense: ^[a-zA-Z0-9_]+@[a-z]+\\.[a-z]{2,6}$ but it worked. It validated email addresses; sort of. Edge cases still slipped through. user+tag@domain.co.uk would fail = the pattern didn't account for plus signs or multiple dots. Version 7 of the validator finally got it right. After 6 failed attempts.",
    "The terminal output was overwhelming: `ls -la | grep config` returned 47 results. She piped it through `wc -l` to count them (47 exactly) and then through `head -10` to see the first few. Unix philosophy: small tools that do one thing well. Chain them together with pipes (|) and suddenly you're powerful. Or at least you feel that way.",
    "HTML tags follow a simple pattern: <div>, <span>, <p>, <a>. Opening tags need closing tags (</div>, </span>) or the browser gets confused. Self-closing tags like <br/> and <img/> are exceptions. She learned this the hard way when her entire page collapsed because of one missing </table>. Debugging HTML is 90% counting angle brackets.",
    "The math homework covered inequalities: if x > 5 and y < 10, what is the range of x + y? She wrote it out: (5, infinity) + (-infinity, 10) = (-infinity, 15). Wait, that's not right. She erased it and tried again. The parentheses mattered (exclusive) versus brackets [inclusive]. Math notation is its own language.",
    "File permissions on Unix use octal: 755 means rwxr-xr-x (read/write/execute for owner, read/execute for others). She ran `chmod 644 config.txt` to make it readable but not executable. The asterisk (*) in `rm *.tmp` still scared her. One wrong wildcard and you've deleted everything. Power tools require respect.",
    "The CSS selector was getting ridiculous: `div.container > ul.nav-list li:nth-child(odd):not(.disabled)`. She wondered if anyone would understand it in 6 months (including herself). The > means direct child; the ~ means sibling. She added a comment: /* targets odd nav items that aren't disabled */ and called it done.",
    "His commit message read: \"Fix bug #247 - null pointer exception in user_auth module (see issue tracker)\". The underscore in variable names was a team convention; some preferred camelCase. He added the percent-complete to the PR description: 100% tests passing, 0% documentation written. Tomorrow's problem.",
    "The stock dropped 15% overnight! She checked the news: nothing obvious. Volume was 3x normal (about 1.2M shares). The 52-week range showed $45 (low) to $127 (high); current price was ~$68. She set alerts at <$60 and >$80. Markets are random walks, she reminded herself. But she still watched the ticker refresh every 30 seconds."
  ]
}
